In [1]:
# Create a Spark Session
from pyspark.sql import SparkSession
spark = (
        SparkSession.builder.appName("Jupyter Sample Application")
        .getOrCreate()
    )

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/08/29 19:52:29 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
25/08/29 19:52:29 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [3]:
# Run Spark SQL 
spark.sql("select 1").show()

+---+
|  1|
+---+
|  1|
+---+

We can  also run Spark SQL directly with the `%%sql` magic.

In [4]:
%%sql
select 1

25/08/29 18:43:29 WARN SparkSession: Using an existing Spark session; only runtime SQL configurations will take effect.

+---+
| 1 |
+---+
| 1 |
+---+

In [5]:
%%sql
show schemas;

+-----------+
| namespace |
+-----------+
+-----------+

Let's create a schema and a table.

In [6]:
%%sql
create schema sample;

++
||
++
++

In [7]:
%%sql
create table sample.employee (
    id integer,
    name string
)

++
||
++
++

In [8]:
%%sql
describe extended sample.employee;

+------------------------------+---------------------------------------------------------------------------------------------------------+---------+
|                     col_name |                                                                                               data_type | comment |
+------------------------------+---------------------------------------------------------------------------------------------------------+---------+
|                           id |                                                                                                     int |    None |
|                         name |                                                                                                  string |    None |
|                              |                                                                                                         |         |
|           # Metadata Columns |                                                                                                         |         |
|                     _spec_id |                                                                                                     int |         |
|                   _partition |                                                                                                struct<> |         |
|                        _file |                                                                                                  string |         |
|                         _pos |                                                                                                  bigint |         |
|                     _deleted |                                                                                                 boolean |         |
|                              |                                                                                                         |         |
| # Detailed Table Information |                                                                                                         |         |
|                         Name |                                                                                    demo.sample.employee |         |
|                         Type |                                                                                                 MANAGED |         |
|                     Location |                                                                          s3://warehouse/sample/employee |         |
|                     Provider |                                                                                                 iceberg |         |
|                        Owner |                                                                                                    root |         |
|             Table Properties | [current-snapshot-id=none,format=iceberg/parquet,format-version=2,write.parquet.compression-codec=zstd] |         |
+------------------------------+---------------------------------------------------------------------------------------------------------+---------+

We can see from the `Table Properties` that this table is of the `iceberg` format. Let's insert some data.

In [9]:
%%sql
INSERT INTO sample.employee VALUES 
  (1, 'John Smith'),
  (2, 'Sarah Johnson'),
  (3, 'Mike Davis');

++
||
++
++

In [11]:
%%sql
select * from sample.employee;

+----+---------------+
| id |          name |
+----+---------------+
|  1 |    John Smith |
|  2 | Sarah Johnson |
|  3 |    Mike Davis |
+----+---------------+

If you open minio in your browser by opening [localhost:9001](http://localhost:9001) and login with username: admin and password: password you will be able to see the table data.

In [3]:
%%sql
select * from sample_db.employees;

+-------------+----------------+-------------+---------+------------------+------------+------------------+
| employee_id |           name |  department |  salary | experience_years |  hire_date | experience_level |
+-------------+----------------+-------------+---------+------------------+------------+------------------+
|           1 |  Alice Johnson | Engineering | 85000.0 |                3 | 2021-03-15 |        Mid-level |
|           2 |      Bob Smith |   Marketing | 65000.0 |                2 | 2022-01-10 |        Mid-level |
|           3 | Carol Williams | Engineering | 95000.0 |                5 | 2019-08-20 |           Senior |
|           4 |    David Brown |       Sales | 55000.0 |                1 | 2023-02-28 |           Junior |
|           5 |   Eva Martinez | Engineering | 78000.0 |                2 | 2022-06-01 |        Mid-level |
|           6 |   Frank Wilson |   Marketing | 72000.0 |                4 | 2020-11-12 |           Senior |
|           7 |      Grace Lee |       Sales | 62000.0 |                3 | 2021-09-05 |        Mid-level |
|           8 |    Henry Davis | Engineering | 88000.0 |                4 | 2020-04-18 |           Senior |
|           9 |       Ivy Chen |   Marketing | 68000.0 |                2 | 2022-03-22 |        Mid-level |
|          10 |  Jack Thompson |       Sales | 58000.0 |                1 | 2023-01-15 |           Junior |
+-------------+----------------+-------------+---------+------------------+------------+------------------+

In [4]:
spark.table("sample_db.employees").show()

+-----------+--------------+-----------+-------+----------------+----------+----------------+
|employee_id|          name| department| salary|experience_years| hire_date|experience_level|
+-----------+--------------+-----------+-------+----------------+----------+----------------+
|          1| Alice Johnson|Engineering|85000.0|               3|2021-03-15|       Mid-level|
|          2|     Bob Smith|  Marketing|65000.0|               2|2022-01-10|       Mid-level|
|          3|Carol Williams|Engineering|95000.0|               5|2019-08-20|          Senior|
|          4|   David Brown|      Sales|55000.0|               1|2023-02-28|          Junior|
|          5|  Eva Martinez|Engineering|78000.0|               2|2022-06-01|       Mid-level|
|          6|  Frank Wilson|  Marketing|72000.0|               4|2020-11-12|          Senior|
|          7|     Grace Lee|      Sales|62000.0|               3|2021-09-05|       Mid-level|
|          8|   Henry Davis|Engineering|88000.0|               4|2020-04-18|          Senior|
|          9|      Ivy Chen|  Marketing|68000.0|               2|2022-03-22|       Mid-level|
|         10| Jack Thompson|      Sales|58000.0|               1|2023-01-15|          Junior|
+-----------+--------------+-----------+-------+----------------+----------+----------------+

In [5]:
%%sql
describe extended sample_db.employees;

+------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+
|                     col_name |                                                                                                                                                        data_type | comment |
+------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+
|                  employee_id |                                                                                                                                                              int |    None |
|                         name |                                                                                                                                                           string |    None |
|                   department |                                                                                                                                                           string |    None |
|                       salary |                                                                                                                                                           double |    None |
|             experience_years |                                                                                                                                                              int |    None |
|                    hire_date |                                                                                                                                                             date |    None |
|             experience_level |                                                                                                                                                           string |    None |
|                              |                                                                                                                                                                  |         |
|           # Metadata Columns |                                                                                                                                                                  |         |
|                     _spec_id |                                                                                                                                                              int |         |
|                   _partition |                                                                                                                                                         struct<> |         |
|                        _file |                                                                                                                                                           string |         |
|                         _pos |                                                                                                                                                           bigint |         |
|                     _deleted |                                                                                                                                                          boolean |         |
|                              |                                                                                                                                                                  |         |
| # Detailed Table Information |                                                                                                                                                                  |         |
|                         Name |                                                                                                                                         demo.sample_db.employees |         |
|                         Type |                                                                                                                                                          MANAGED |         |
|                     Location |                                                                                                                               s3://warehouse/sample_db/employees |         |
|                     Provider |                                                                                                                                                          iceberg |         |
|                        Owner |                                                                                                                                                             root |         |
|             Table Properties | [created-at=2025-08-29T19:31:09.075185462Z,current-snapshot-id=6006498447171045242,format=iceberg/parquet,format-version=2,write.parquet.compression-codec=zstd] |         |
+------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+

In [40]:
snapshots = spark.sql("SELECT * FROM demo.sample_db.employees.snapshots").collect()

for s in snapshots:
    print(f"Snapshot ID: {s.snapshot_id}, Timestamp: {s.committed_at}, Operation: {s.operation}")

Snapshot ID: 1163501592288989464, Timestamp: 2025-08-29 19:31:10.113000, Operation: append
Snapshot ID: 6006498447171045242, Timestamp: 2025-08-29 19:32:11.434000, Operation: append

In [41]:

#Par snapshot ID

snapshots_df = spark.sql("""
  SELECT * FROM sample_db.employees VERSION AS OF 6006498447171045242;
""")
snapshots_df.show(truncate=False)

# snapshots_df = spark.sql("""
#   SELECT * FROM demo.sample_db.employees VERSION AS OF 6006498447171045242;
# """)
# snapshots_df.show(truncate=False)

+-----------+--------------+-----------+-------+----------------+----------+----------------+
|employee_id|name          |department |salary |experience_years|hire_date |experience_level|
+-----------+--------------+-----------+-------+----------------+----------+----------------+
|1          |Alice Johnson |Engineering|85000.0|3               |2021-03-15|Mid-level       |
|2          |Bob Smith     |Marketing  |65000.0|2               |2022-01-10|Mid-level       |
|3          |Carol Williams|Engineering|95000.0|5               |2019-08-20|Senior          |
|4          |David Brown   |Sales      |55000.0|1               |2023-02-28|Junior          |
|5          |Eva Martinez  |Engineering|78000.0|2               |2022-06-01|Mid-level       |
|6          |Frank Wilson  |Marketing  |72000.0|4               |2020-11-12|Senior          |
|7          |Grace Lee     |Sales      |62000.0|3               |2021-09-05|Mid-level       |
|8          |Henry Davis   |Engineering|88000.0|4               |2020-04-18|Senior          |
|9          |Ivy Chen      |Marketing  |68000.0|2               |2022-03-22|Mid-level       |
|10         |Jack Thompson |Sales      |58000.0|1               |2023-01-15|Junior          |
+-----------+--------------+-----------+-------+----------------+----------+----------------+

In [42]:
#-- Par timestamp
#SELECT * FROM demo.sample_db.employees TIMESTAMP AS OF '2025-08-29 19:00:00'

snapshots_df = spark.sql("""
  SELECT * FROM demo.sample_db.employees TIMESTAMP AS OF '2025-08-29 19:31:10.113000';
""")
snapshots_df.show(truncate=False)

+-----------+--------------+-----------+-------+----------------+----------+----------------+
|employee_id|name          |department |salary |experience_years|hire_date |experience_level|
+-----------+--------------+-----------+-------+----------------+----------+----------------+
|1          |Alice Johnson |Engineering|85000.0|3               |2021-03-15|Mid-level       |
|2          |Bob Smith     |Marketing  |65000.0|2               |2022-01-10|Mid-level       |
|3          |Carol Williams|Engineering|95000.0|5               |2019-08-20|Senior          |
|4          |David Brown   |Sales      |55000.0|1               |2023-02-28|Junior          |
|5          |Eva Martinez  |Engineering|78000.0|2               |2022-06-01|Mid-level       |
|6          |Frank Wilson  |Marketing  |72000.0|4               |2020-11-12|Senior          |
|7          |Grace Lee     |Sales      |62000.0|3               |2021-09-05|Mid-level       |
|8          |Henry Davis   |Engineering|88000.0|4               |2020-04-18|Senior          |
|9          |Ivy Chen      |Marketing  |68000.0|2               |2022-03-22|Mid-level       |
|10         |Jack Thompson |Sales      |58000.0|1               |2023-01-15|Junior          |
+-----------+--------------+-----------+-------+----------------+----------+----------------+

In [35]:
snapshots = spark.sql("SELECT * FROM demo.sample_db.employees.snapshots").collect()

for s in snapshots:
    print(f"Snapshot ID: {s.snapshot_id}, Timestamp: {s.committed_at}, Operation: {s.operation}")

Snapshot ID: 1163501592288989464, Timestamp: 2025-08-29 19:31:10.113000, Operation: append
Snapshot ID: 6006498447171045242, Timestamp: 2025-08-29 19:32:11.434000, Operation: append

In [12]:
spark.stop()